{
  "adventureAndExploration": {
    "description": "OSRIC is a game of adventure, with exploration at its core. Whether the party is investigating a ruined shrine, delving into an abandoned dwarfish mine, traversing an unknown wilderness, sailing uncharted waters, or even venturing into other planes of existence, exploration drives the game. Although combat rules occupy more pages, play tends to focus on the free-form nature of exploration, where description and negotiation are central.",
    "timeMeasurement": "In dungeons, time is measured in turns (each turn representing ten minutes). In the wilderness or at sea, time is measured in days. The planes of existence are a special case and may follow either system—or neither.",
    "searchingTheDungeon": {
      "description": "Indoor locations—whether man-made tunnels, natural caves, abandoned mines, sewers, enemy fortresses, wizard towers, or dark shrines—are collectively known as 'dungeons'. These enclosed spaces share similar characteristics and are resolved using the same procedures.",
      "orderOfPlay": [
        {
          "step": 1,
          "title": "Wandering Monster Check",
          "details": "Every third turn, the GM rolls to determine if any wandering monsters are encountered (typically a 1 in 6 chance; see specific level keys for adjustments)."
        },
        {
          "step": 2,
          "title": "Statement of Action",
          "details": "The party's caller or an individual player describes the intended activities. The actions are then resolved by the GM. Possible actions include:",
          "actions": [
            {
              "action": "Move",
              "details": "Characters may move up to their full move rate per turn for cautious movement (mapping allowed) or at 5× the normal rate through familiar areas (mapping not permitted)."
            },
            {
              "action": "Listen for noise",
              "details": "Requires 1 round per attempt with a standard 10% chance for success (adjusted for classes like thieves/assassins and races such as elves, gnomes, halflings, or half-orcs). Only 3 attempts are allowed per situation (e.g., at a door)."
            },
            {
              "action": "Open a stuck or locked door",
              "details": "Takes 1 round per attempt. Stuck doors have a 2 in 6 chance for success (possibly modified by strength). Locked doors require a key, knock spell, exceptional strength, lock picking, or direct force. Unlimited retries are allowed, but no element of surprise remains after failure."
            },
            {
              "action": "Search for traps",
              "details": "Takes between 1 and 4 rounds per attempt, covering a single object or location. The chance for success is determined by race (e.g., dwarf or gnome), class (e.g., thief or assassin), or free-form negotiation by the GM."
            },
            {
              "action": "Casually examine (and map) a room or area",
              "details": "Requires 1 turn per 20×20 ft room or area."
            },
            {
              "action": "Thoroughly examine and search for secret doors",
              "details": "Takes 1 turn per 10×10 ft area with a standard 1 in 6 chance for success (2 in 6 for elves and half-elves)."
            },
            {
              "action": "Cast a spell",
              "details": "Follow the specific spell descriptions in Chapter II for casting times and effects."
            },
            {
              "action": "Rest",
              "details": "Typically, 1 turn in every 6, plus an extra turn after every combat encounter, must be dedicated to resting (no movement or strenuous activity is allowed)."
            },
            {
              "action": "Other activities",
              "details": "The duration and likelihood of success are determined on an ad hoc basis by the GM."
            }
          ]
        },
        {
          "step": 3,
          "title": "Encounters",
          "details": "If an encounter occurs—whether with a wandering monster or a planned foe—the GM determines surprise, distance, and reactions, resolving the event through negotiation, evasion, or combat."
        },
        {
          "step": 4,
          "title": "Book-keeping",
          "details": "At the end of each turn, the GM records that time has elapsed and deducts resources used (such as lost hit points, expiring spell durations, torches burning out, etc.)."
        }
      ],
      "combiningActions": "Since each turn represents ten minutes, characters may combine several brief actions into one turn (for example, drawing a weapon, moving to a door, and attempting to open it). Longer or more complex tasks may require several turns, during which the party should protect the character engaged in such activities from unexpected attacks."
    },
    "guidingPrinciple": "The exploration rules are designed to maximize the number of meaningful decisions made by the players while minimizing the frequency of dice rolls between decisions."
  },
  "wanderingMonsters": {
    "baseFrequency": {
      "checkInterval": "Every third turn",
      "encounterChance": "1 in 6"
    },
    "specialProvisions": [
      {
        "dungeon": "Pod Caverns of the Sinister Shroom (Level 1)",
        "encounterChance": "1 in 10"
      }
    ],
    "determination": "If a wandering monster appears, determine the creature randomly unless some factor makes it obvious what the party has encountered.",
    "environmentAppropriateness": "Wandering monsters should be appropriate to the dungeon's environment in both type and encounter difficulty. Typically, the deeper the dungeon level, the more numerous and deadly the monsters. For example, first-level dungeons usually yield first-level monsters (with the occasional second-level creature), while deeper levels might produce third or fourth level monsters.",
    "variationExample": "In the Red Mausoleum, an adventure for characters level 12 and higher, even the very first level may contain extremely powerful monsters.",
    "purpose": {
      "narrative": "Creates the impression of a 'living dungeon' without requiring the GM to schedule every creature's activity.",
      "mechanical": "Discourages players from wasting time and overly meticulous search (i.e., 'pixel-hunting') by ensuring there is always some potential for unexpected encounters."
    },
    "gmAdjustments": "The GM may adjust or even skip wandering monster checks based on the intended pacing of the game. If the party is stealthy, swift, and avoids lingering in one spot, the chance of encountering wandering monsters should be correspondingly reduced."
  },
  "movementDuringDungeonExploration": {
    "description": "Character movement in a dungeon is measured at a slow, cautious rate—typically 1/10th of their combat speed—to allow for mapping and careful progress. When traversing familiar areas or following an existing map, characters can move up to 5× their normal per-turn move rate. In urgent situations (such as fleeing), they may run at 10× their normal rate (full combat speed), though no mapping is possible during such sprints and a double rest period is required after the pursuit.",
    "moveRates": {
      "cautious": "1/10th normal combat speed (allows mapping)",
      "familiar": "Up to 5× per-turn move rate (no mapping allowed)",
      "fleeing": "10× per-turn move rate (full combat speed, then a double rest period required)"
    },
    "groupMovement": "The party's movement is limited by the slowest member.",
    "formation": {
      "description": "Players should determine a 'marching order' (front, middle, and rear). In a standard 10-ft wide corridor, up to three characters may walk abreast; large weapons (e.g., flails, two-handed swords) may reduce this to two or even one. Characters in the second rank are usually restricted to long weapons (spears or pole arms) or missile attacks over the heads of shorter comrades (such as gnomes or halflings).",
      "tracking": "Miniatures can be used placed on a board for visual reference, or players may submit a written marching order. Should the party's formation be unclear, the GM may determine positions using a die roll."
    }
  },
  "listening": {
    "description": "Listening is typically performed at key moments such as before opening doors or entering new areas. It allows the party to detect noises that might signal hidden threats or the presence of monsters.",
    "mechanics": {
      "baseChance": {
        "default": "10%",
        "enhanced": "15% (for elves, gnomes, halflings, and half-orcs)"
      },
      "classModifiers": "Thieves and assassins enjoy an enhanced chance over the base probability.",
      "attempts": "Each listening attempt takes 1 round; a character may try up to 3 times in succession before further attempts fail until they rest for at least one turn.",
      "gmRoll": "The GM makes the roll in secret so that players cannot discern whether no noise was present or if the roll failed.",
      "successOutcome": "On a successful check, the GM determines if there is any noise. Generally, if a monster is present and the check is passed, the party gains a clue about its nature. For example, rather than stating 'you hear a giant spider,' the GM might say 'you hear a scuttling, rattling sound.' Note that some stealthy monsters (e.g., bugbears) may remain undetected by listening.",
      "additionalNotes": "Characters who speak monster languages may overhear snippets of conversation, but the GM should only describe sounds that the characters would realistically perceive.",
      "caveat": "Remember that monsters can hear the party as well.",
      "balance": "While frequent listening attempts can help players make informed decisions, an excessive number of attempts may slow gameplay. GMs should discourage overuse by emphasizing the inconvenience of doffing headgear or by introducing in-game penalties (such as traps that target those who listen too often). In extremely dangerous areas, however, players should not be penalized for taking due caution."
    }
  },
  "openingDoors": {
    "description": "Opening doors is normally straightforward—the player (or party caller) declares the action and the door simply opens. However, in many dungeons doors may be stuck, locked, braced, jammed, spiked shut, or held fast by magical means such as a wizard lock spell.",
    "normalProcedure": "For a normal door, no roll is necessary; the door is opened when the action is declared.",
    "stuckDoors": {
      "description": "Stuck doors must be forced open by brute strength. Depending on the door's size, more than one character may attempt to force it simultaneously (for example, two characters could try on a 6 ft wide door; each makes a strength check, and a single success may be enough to open it).",
      "attempts": "Each attempt to force a stuck door takes one round per try. Additional tries cause extra time and noise, increasing the odds of encountering a wandering monster. A failed attempt prevents surprise on any creature on the other side."
    },
    "lockedDoors": {
      "description": "Locked doors require a key, the assistance of a thief or assassin for lock-picking, or can be broken down with axes or battering rams. Lock-picking attempts (as handled in Chapter I) typically take between 1 round and 1 turn per attempt (usually 1–4 rounds in total)."
    },
    "choppingDoors": {
      "description": "Chopping down a door with an axe or similar means is time-consuming and noisy. It takes at least a full turn to chop down a standard-size door, during which several wandering monster checks are made. In such cases, the party forfeits any possibility of surprising creatures on the other side."
    },
    "postOpening": {
      "description": "Once a door is opened, it is usually difficult to keep it in that state. Adventurers may struggle to hold it open or closed, while monsters can open doors automatically unless prevented. The conventional solution is to wedge the door with iron spikes, though even a spiked door has a 20-30% chance (at the GM's discretion) to slip."
    },
    "gmGuidance": "When designing the dungeon, the GM should note which doors are normal, stuck, locked, etc., as well as the locations of any keys."
  },
  "searching": {
    "secretDoors": {
      "description": "Searching for secret doors is a common activity that takes a full turn for each 10×10 ft area examined. Normally, most characters have a 1 in 6 chance of finding a secret door, while elves and half-elves benefit from an improved 2 in 6 chance.",
      "notes": "Players may attempt negotiation-based searches by carefully describing their approach (for example, tapping along a wall to listen for hollow echoes or inspecting for irregular stonework) which can grant bonuses or even automatic success if the GM deems their description convincing. However, detailed searches generally take longer than standard and may increase the chance of encountering wandering monsters."
    },
    "searchingForTraps": {
      "description": "Searching for traps is best handled by characters such as dwarfs, gnomes, thieves, or assassins. A trap search typically takes 1-4 rounds per attempt and is restricted to a specific object or a small area (no more than 5×5 ft) as indicated by the player (for example, 'I search the door for traps' or 'I examine the chest for traps').",
      "notes": "The success chance for trap searches is determined by the character's race and class, as described in Chapter I."
    },
    "negotiatedSearches": {
      "description": "Negotiation-based searches allow players to describe their actions in detail, potentially earning a bonus or even ensuring success for finding secret doors or traps. For example, characters might search a wall for loose stones or suspicious indentations.",
      "notes": "If the description is on target, the GM may increase the success chance or even bypass the die roll altogether. Conversely, off-target descriptions may lower the chance of success. These detailed, negotiated searches typically require more time than the standard checks and may elevate the risk of encountering wandering monsters."
    },
    "disarmingTraps": {
      "description": "Disarming traps is usually attempted by thieves or assassins, taking 1–4 rounds per attempt for a simple trap; complex traps may require a full turn. Other characters typically have little chance of disarming traps unless a careful negotiation or creative thinking yields a bonus.",
      "notes": "Players might suggest unconventional solutions (for example, wedging a pressure plate or using beeswax to seal a gas vent), which the GM may reward or penalize based on accuracy and feasibility."
    },
    "triggeringTraps": {
      "description": "Traps that are neither avoided nor successfully disarmed will trigger 50% of the time. The GM should define each trap by its specific nature and effect, including damage values appropriate for the dungeon level.",
      "notes": "For lower-level dungeons, traps might inflict 1d6 (or at worst 1d10) damage and avoid instant death effects, while higher-level dungeons might feature more lethal traps—albeit with saving throws or mitigating measures provided."
    },
    "castingSpells": {
      "description": "Many spells—especially those of detection and divination—can greatly facilitate exploration. Spells such as knock or locate object may prove as crucial to success as many combat or healing spells.",
      "notes": "Players decide the balance between using utility spells versus combat or healing magic; casting times and effects are detailed in Chapter II."
    }
  },
  "restPeriods": {
    "description": "Rest periods are essential during prolonged dungeon exploration to restore spells and recover from strenuous activity.",
    "requirements": {
      "standardRest": "1 turn is required out of every 6 turns during exploration and 1 turn after each combat encounter.",
      "pursuitRest": "A double-length rest period (2 turns) is required after an evasion or pursuit.",
      "extendedRest": "If the party remains in the dungeon for several hours and cannot return to the surface, they may spend an entire 'night' resting. During this time, the party cannot move or engage in any strenuous activity (passive actions such as mapping are permitted)."
    },
    "notes": "Players should schedule rest periods in secure, defensible, and inconspicuous locations (for example, a small, out-of-the-way room with a single door that can be spiked shut). Failure to take required rest periods results in fatigue, which can reduce movement rates, impose combat penalties, lower ability scores, and decrease the morale of NPC companions."
  },
  "otherActions": {
    "description": "Various ad hoc actions beyond predefined searches can be attempted. Examples include a dwarf determining the depth underground, a gnome determining direction, a paladin detecting evil, or a ranger tracking a set of footprints.",
    "duration": "Unless specified otherwise, these actions typically take 1 round per attempt.",
    "adHocResolution": "For actions that fall outside standard procedures, the GM should determine the chance of success based on the specific circumstances, taking into account the character’s race, class, level, and relevant ability scores. The GM may inform the player of the chance before proceeding, allowing the player to decide if they wish to roll. Alternatively, the GM may roll in secret if the situation demands."
  },
  "gmGuidance": {
    "description": "The GM is encouraged to reference similar established checks—such as those for opening doors or for knowing spells—to adjudicate ad hoc tasks. Striking a balance is key: thorough searches should yield a realistic chance of success while ensuring that the pace of play remains brisk and engaging. The GM should also be transparent with players regarding the risks of excessive searching, which may increase the likelihood of wandering monster encounters."
  }
}
