{
  "wildernessExploration": {
    "description": "In OSRIC, 'Wilderness' includes open-country adventures as well as those at sea. The basic unit of time for wilderness exploration is the day, and hexagonal-grid maps ('hex paper') are recommended for pre-drawing wilderness maps.",
    "timeManagement": "Static actions typically take negligible time on a wilderness timescale and can often be combined with a normal move within the same day.",
    "orderOfPlay": [
      {
        "step": 1,
        "title": "Setup",
        "details": "The GM informs the party of the prevailing weather conditions, and the party decides on their direction of travel."
      },
      {
        "step": 2,
        "title": "Navigation",
        "details": "The GM secretly checks if the party becomes lost, considering terrain, weather, and any navigational aids."
      },
      {
        "step": 3,
        "title": "Wandering Monster Check (Day)",
        "details": "The GM rolls to check for wandering monsters during the day."
      },
      {
        "step": 4,
        "title": "Move and Act",
        "details": "Party members move and perform any stationary actions, as desired."
      },
      {
        "step": 5,
        "title": "Encounter",
        "details": "Any encounters are resolved, whether through negotiation, evasion, or combat."
      },
      {
        "step": 6,
        "title": "Camp",
        "details": "The GM presents available campsite options, and the party sets up camp."
      },
      {
        "step": 7,
        "title": "Wandering Monster Check (Night)",
        "details": "The GM rolls for wandering monsters during the night and resolves any resulting encounters."
      }
    ],
    "gmGuidance": "New GMs should resolve each day of wilderness exploration separately to maintain structured play. More experienced GMs may combine multiple days of exploration when comfortable with the mechanics.",

    "stepsOfPlay": [
      {
        "step": 1,
        "title": "Weather and Direction",
        "details": "The GM determines the prevailing weather and informs the party, while the party chooses their direction of travel."
      },
      {
        "step": 2,
        "title": "Lost",
        "details": "The GM secretly rolls to determine if the party becomes lost, taking into account terrain and weather conditions. Parties following roads, rivers, maps, or familiar terrain are not subject to being lost."
      },
      {
        "step": 3,
        "title": "Wandering Monster Check (Day)",
        "details": "The GM makes wandering monster checks twice during the day and adjusts encounter likelihood based on terrain conditions."
      },
      {
        "step": 4,
        "title": "Movement and Stationary Actions",
        "details": "Party members move and perform stationary actions as needed."
      },
      {
        "step": 5,
        "title": "Encounter Resolution",
        "details": "Encounters are resolved, with wilderness tactics differing from dungeon play (horses, missile weapons, and long-range spells are more effective)."
      },
      {
        "step": 6,
        "title": "Camping",
        "details": "The GM advises the party on campsite options; the party camps."
      },
      {
        "step": 7,
        "title": "Wandering Monster Check (Night)",
        "details": "The GM performs a third wandering monster check overnight, resolving any encounters that arise."
      }
    ],
    "mechanics": {
      "weatherAndDirection": {
        "description": "The GM determines the weather based on campaign setting. Pre-generated rules can be used for realism, or the GM can use intuition to enhance narrative tension.",
        "notes": "Weather-generation rules vary widely; a campaign set in a Norse winterland would require very different parameters from one set in a Caribbean archipelago."
      },
      "navigationAndGettingLost": {
        "description": "Parties do not get lost while following established paths like roads, rivers, maps, or terrain familiar to one party member. Otherwise, their chance of getting lost depends on terrain and prevailing weather.",
        "guidelines": "Allow a 10%-25% chance of getting lost under normal conditions.",
        "lostDirection": "If lost, the party’s random direction is typically within a 60° arc in front of them; exceptionally bad rolls may widen this to a 120° arc. Total reversals of direction are rare."
      },
      "wanderingMonsters": {
        "description": "The GM makes two checks each day (with a 1 in 12 chance of encounter per check) and a third check at night. Adjust frequency based on the terrain—e.g., fewer checks in patrolled regions and more in hostile areas like goblin-infested forests."
      },
      "movementAndActions": {
        "description": "Movement follows the rules established for dungeons, but wilderness exploration allows combining movement with negligible static actions within the same day."
      },
      "encounterResolution": {
        "description": "Encounter mechanics mirror those used in dungeons, but wilderness environments necessitate different tactical approaches—horses, missile weapons, and long-range spells are particularly advantageous."
      },
      "camping": {
        "description": "Camping is vital for spell recovery, animal rest, and general physical recuperation. Parties avoiding rest accrue penalties.",
        "penalties": [
          {
            "duration": "After 1 night without rest",
            "effect": "-2 or -10% penalty to ability scores, attack rolls, damage rolls, and saving throws."
          },
          {
            "duration": "After 2 nights without rest",
            "effect": "-5 penalty; spellcasters forget previously memorized spells."
          },
          {
            "duration": "After 3 nights without rest",
            "effect": "System shock rolls are required or characters involuntarily fall asleep."
          }
        ],
        "watchRota": "Sensible parties establish a watch rota overnight to safeguard resting members."
      }
    }
  },
  "aerialAgility": {
    "description": "Aerial agility covers the basics of flying creatures and movement while airborne, assisting the GM with flying monsters or mounts. Flying creatures ascend at half their movement rate and dive at a 45° angle, descending 1 ft for every 1 ft of forward movement, unless they possess aerial agility level VI. Diving attacks over 30 ft confer a double damage bonus against non-diving targets, including ground-based ones. Climbing attacks incur no penalty to damage or accuracy.",
    "operationalCeiling": "The GM may consider an operational flying ceiling of 5,000 ft above sea level (Earth's upper breathable limit), though campaign worlds may differ.",
    "sizeAndAgility": "Lower agility levels typically correspond to larger, more massive creatures, while smaller and lighter creatures tend to exhibit higher agility levels. Riding a flying monster decreases its agility by one step unless it is a very large creature, such as a dragon.",
    "turningCapacity": "Turning assumes full movement rate. Creatures moving at half-speed turn as if one class higher. Levels II, III, and IV must maintain at least half-speed to remain airborne.",
    "agilityLevels": [
      {
        "level": "I",
        "description": "Barely a flying creature, relying on wind currents or gliding. Movement is slow and maneuverability resembles a hot air balloon. Includes creatures like flying squirrels, flying fish, or those affected by the levitate spell."
      },
      {
        "level": "II",
        "description": "Requires 5 rounds to reach full airspeed. Turns 30° per round. Example: dragon."
      },
      {
        "level": "III",
        "description": "Reaches full airspeed in 2 rounds and turns 60° per round. Example: sphinx."
      },
      {
        "level": "IV",
        "description": "Average agility. Reaches full airspeed in 1 round and turns 90° per round. Examples: flying carpet, giant bat."
      },
      {
        "level": "V",
        "description": "Reaches full airspeed in 6 segments, can turn 120° per round, and hover. Can stop completely in 6 segments. Examples: fly spell, mephit."
      },
      {
        "level": "VI",
        "description": "Natural fliers with nearly complete control. Reaches full speed or stops completely in 1 segment. Executes 180° turns and can hover gracefully. Examples: genie, air elemental."
      }
    ]
  },
"specialCases": {
    "sailingVessels": {
      "description": "Movement in sailing vessels is heavily influenced by wind direction. While ships can make progress into a headwind by tacking, greater speed requires the wind to come from roughly behind.",
      "gmGuidance": "GMs running sea-focused campaigns should establish prevailing trade winds to avoid purely random decisions that statistically hinder ship progress over the long term."
    },
    "underwaterMovement": {
      "description": "Underwater movement may become viable if players acquire appropriate magic items. However, combat and spellcasting are severely limited in this environment.",
      "limitations": [
        "Missile weapons are virtually useless.",
        "Many hand weapons are ineffective.",
        "Magic invoking fire fails.",
        "Magic involving lightning often strikes the caster."
      ]
    }
}