{
  "chapter": "DAMAGE AND DEATH",
  "sections": [
    {
      "title": "Damage and Death",
      "description": "When a character or creature is hit, damage is subtracted from their hit points. Once hit points reach 0, the character becomes unconscious and begins to lose 1 hit point per round due to blood loss until death occurs at –10 hit points. Any additional damage suffered while unconscious (aside from the ongoing blood loss) is lethal.",
      "rules": [
        "At 0 hit points, the character is rendered unconscious.",
        "The character loses 1 hp per round from blood loss until death at –10 hp.",
        "Additional damage (other than bleeding) on an unconscious character causes instant death.",
        "Blood loss can be stopped immediately in a round when aid is provided.",
        "After recovering to 1 or more hp by healing, potion use, or natural rest, the character remains in a coma for 1–6 turns and must rest for at least one week before engaging in strenuous physical or mental activity.",
        "If a character is reduced to –6 hp or below, permanent scarring or lingering injuries are likely to occur."
      ]
    },
    {
      "title": "Natural Healing",
      "description": "Characters recover hit points naturally through rest.",
      "rules": [
        "A character recovers 1 hit point per day of uninterrupted rest.",
        "If the character has a constitution penalty to hit points, they must rest for a number of days equal to that penalty before natural healing begins.",
        "After one week of rest, the number of hit points regained during the second week is increased by the character’s starting hit point bonus.",
        "Four weeks of continuous rest will fully restore any character’s hit points."
      ]
    },
    {
      "title": "Subdual Damage",
      "description": "Subdual damage is non-lethal damage used to incapacitate opponents rather than kill them.",
      "rules": [
        "When inflicting subdual damage, the weapon’s damage is divided so that half is 'real' (lethal) and half is subdual.",
        "Subdual damage does not kill and is recovered at a rate of 1 hit point per hour.",
        "Typically, only humanoids and select special creatures (such as dragons) may be subdued in this manner.",
        "In situations like knightly tourneys, opponents may agree in advance to accept subdual damage as a means of defeat."
      ]
    },
    {
      "title": "Life Energy Levels and Level Drain",
      "description": "Certain monsters, magic items, and spells can drain a character’s life energy—resulting in a reduction of experience levels (level drain).",
      "rules": [
        "When a character is drained of a life energy level, they lose one complete level of experience and are placed at the beginning of the new level.",
        "For multi-classed or dual-classed characters, the highest level achieved is the one that is lost; if levels are equal, the lost level is determined randomly.",
        "A player character drained below level 1 is slain and may subsequently be raised as an undead creature.",
        "Non-player characters lose a level or lose a hit die, as appropriate."
      ]
    }
  ],
  "resurrection": {
    "description": "Characters who are slain may be raised from the dead if a cleric of sufficient level is available to cast the necessary spell. If no such cleric is present in the party—common for low-level groups—the party may seek help from an NPC High Priest, who typically charges at least 1,000 gp.",
    "notes": [
      "Elves do not have souls and are unaffected by the spells Raise Dead or Resurrection."
    ]
  }
}
