{
  "chapter": "MORALE",
  "description": "Most monsters will not fight on if the battle seems hopeless—they may retreat, surrender, or flee. The GM calls for morale checks, generally when it is clear that the monsters are losing or incurring unacceptable losses. No more than two morale checks should be made per battle; if the monsters pass a second check, they are assumed fanatical and will fight to the death.",
  "baseMorale": {
    "calculation": "50% base, plus 5% per hit die",
    "example": "A monster with 8+1 hit dice gets an additional 40% (8 x 5%), for a total base morale of 90%.",
    "gmAdjustments": "The GM may adjust the base morale based on the monster’s inherent cowardice or heroism, and situational factors—for instance, imposing a -30% penalty if the monster is very cowardly while its fellows are suffering serious losses, or a +10% bonus if it is elite and close to its battle standard."
  },
  "moraleCheckForNPCs": {
    "playerCharacters": "Player characters do not need to check morale.",
    "other": "Hirelings, henchmen, and men-at-arms should check morale normally—their morale may be affected by their liege’s charisma, past conduct, and even alignment (e.g., Chaotic Evil henchmen are more likely to betray their masters than Lawful Good ones)."
  },
  "failureEffects": {
    "description": "The effect of failing a morale check depends on the margin by which the check is failed.",
    "failureMargins": {
      "upTo25": "Typically, the creature will make a fighting withdrawal.",
      "26to50": "The creature will generally turn and flee.",
      "51orHigher": "The creature is likely to surrender."
    },
    "notes": "The GM should use logic and consider the creature’s intelligence and circumstances. For example, a cornered creature that cannot flee—or one that recognizes its foes are significantly faster—may surrender rather than launching a futile flight."
  },
  "noQuarter": {
    "description": "Certain conditions cause a creature to fight to the death regardless of morale.",
    "criteria": "If a creature sees that surrender is not accepted (for example, witnesses a prisoner being slain or believes it will be executed upon surrender), it will never surrender and will fight to the death if unable to flee."
  },
  "moraleModifiers": {
    "allCumulative": true,
    "positive": [
      {
        "situation": "Per friend killed, surrendered, or fled",
        "modifier": "+5%"
      },
      {
        "situation": "Own side taken 25% casualties",
        "modifier": "+5%"
      },
      {
        "situation": "Numerical inferiority",
        "modifier": "+10%"
      },
      {
        "situation": "Own side taken 50% casualties",
        "modifier": "+15%"
      },
      {
        "situation": "Own side greatly outnumbered (2-1 or more)",
        "modifier": "+20%"
      },
      {
        "situation": "Own leader hors de combat",
        "modifier": "+25%"
      }
    ],
    "negative": [
      {
        "situation": "Own side inflicted 25% casualties on foe",
        "modifier": "-5%"
      },
      {
        "situation": "Numerical superiority",
        "modifier": "-5% to -10%"
      },
      {
        "situation": "Own side inflicted 50% casualties on foe",
        "modifier": "-15%"
      }
    ]
  }
}
